{
  "architectures": [
    "TokenClassification"
  ],
  "input_size": 256,
  "lin1_size": 1024,
  "lin2_size": 1024,
  "model_type": "token-classification",
  "num_class": 2,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2",
  "use_identity_layer_for_qual": true,
  "use_qual": true
}
